In [19]:
import pandas as pd
import numpy as np

In [20]:
# Creating DataFrame from a dictionary

countries = {'Name': ['USA', 'India', 'German', 'Rwanda'], 
             
             'Codes':[1, 91, 49, 250] }

df = pd.DataFrame(countries, index=['a', 'b', 'c', 'd'])
df

     Name  Codes
a     USA      1
b   India     91
c  German     49
d  Rwanda    250

In [21]:
df['Name']

a       USA
b     India
c    German
d    Rwanda
Name: Name, dtype: object

In [22]:
df.Name

a       USA
b     India
c    German
d    Rwanda
Name: Name, dtype: object

In [23]:
df ['Codes']

a      1
b     91
c     49
d    250
Name: Codes, dtype: int64

In [24]:
## When you have many columns, columns in list will be selected

df [['Name', 'Codes']]

     Name  Codes
a     USA      1
b   India     91
c  German     49
d  Rwanda    250

In [25]:
# This will return the first two rows
df [0:2]

    Name  Codes
a    USA      1
b  India     91

In [26]:
df.loc['a']

Name     USA
Codes      1
Name: a, dtype: object

In [27]:
df.loc['b':'d']

     Name  Codes
b   India     91
c  German     49
d  Rwanda    250

In [28]:
df [:'b']

    Name  Codes
a    USA      1
b  India     91

In [29]:
df.iloc[2]

Name     German
Codes        49
Name: c, dtype: object

In [30]:
df.iloc[1:3]

     Name  Codes
b   India     91
c  German     49

In [31]:
df.iloc[2:]

     Name  Codes
c  German     49
d  Rwanda    250

In [32]:
#Conditional Selection
df

     Name  Codes
a     USA      1
b   India     91
c  German     49
d  Rwanda    250

In [33]:
#Let's select a country with code 49

df [df['Codes'] == 49 ]

     Name  Codes
c  German     49

In [35]:
df [df['Codes'] < 250]

     Name  Codes
a     USA      1
b   India     91
c  German     49

In [37]:
df [df['Name'] == 'USA']

  Name  Codes
a  USA      1

In [38]:
#You can use and (&) or (|) for more than conditions
#df [(condition 1) & (condition 2)]
df [(df['Codes'] == 91) & (df['Name'] == 'India')]

    Name  Codes
b  India     91

In [40]:
#isin() return false or true when provided value is included in dataframe
sample_codes_names=[1,3,250, 'USA','India','England']
df.isin(sample_codes_names)

    Name  Codes
a   True   True
b   True  False
c  False  False
d  False   True

In [41]:
sample_codes_names = {'Codes':[1,3,250], 'Name':['USA', 'India', 'England']}

df.isin(sample_codes_names)

    Name  Codes
a   True   True
b   True  False
c  False  False
d  False   True

In [42]:
df2 = pd.DataFrame(np.array ([[1,2,3], [4,5,6], [7,8,9]]), 
                   columns = ['column 1', 'column 2', 'column 3'])

df2

   column 1  column 2  column 3
0         1         2         3
1         4         5         6
2         7         8         9

In [43]:
df2.isin([0,3,4,5,7])

   column 1  column 2  column 3
0     False     False      True
1      True      True     False
2      True     False     False

In [44]:
df2 [df2 > 4]

   column 1  column 2  column 3
0       NaN       NaN       NaN
1       NaN       5.0       6.0
2       7.0       8.0       9.0

In [45]:
df2.where(df2 > 4)

   column 1  column 2  column 3
0       NaN       NaN       NaN
1       NaN       5.0       6.0
2       7.0       8.0       9.0

In [46]:
df2.where(df2 > 4, 0)

   column 1  column 2  column 3
0         0         0         0
1         0         5         6
2         7         8         9

In [47]:
df2 [df2 <= 4] = 0
df2

   column 1  column 2  column 3
0         0         0         0
1         0         5         6
2         7         8         9

In [48]:
#Iteration over (column name, Series) pairs
for col_name, content in df2.items():
    print(col_name)
    print(content)

column 1
0    0
1    0
2    7
Name: column 1, dtype: int64
column 2
0    0
1    5
2    8
Name: column 2, dtype: int64
column 3
0    0
1    6
2    9
Name: column 3, dtype: int64

In [51]:
# Iterate over (column name, Series) pairs.
# Same as df.items()

for col_name, content in df2.iteritems():
    print(col_name)
    print(content)

column 1
0    0
1    0
2    7
Name: column 1, dtype: int64
column 2
0    0
1    5
2    8
Name: column 2, dtype: int64
column 3
0    0
1    6
2    9
Name: column 3, dtype: int64

In [52]:
# Iterate over DataFrame rows as (index, Series) pairs
for row in df2.iterrows():
    print(row)

(0, column 1    0
column 2    0
column 3    0
Name: 0, dtype: int64)
(1, column 1    0
column 2    5
column 3    6
Name: 1, dtype: int64)
(2, column 1    7
column 2    8
column 3    9
Name: 2, dtype: int64)

In [53]:
#Iterate over DataFrame rows as namedtuples
for row in df2.itertuples():
    print(row)

Pandas(Index=0, _1=0, _2=0, _3=0)
Pandas(Index=1, _1=0, _2=5, _3=6)
Pandas(Index=2, _1=7, _2=8, _3=9)